{"Version":403110,"Days":[{"Id":1,"Date":"\/Date(1491602400000)\/"}],"Rooms":[{"Id":1,"Code":"004 (88)"},{"Id":2,"Code":"001 (90)"},{"Id":3,"Code":"018 (156)"},{"Id":4,"Code":"015 (117)"},{"Id":5,"Code":"016 (252)"},{"Id":6,"Code":"005 (265)"},{"Id":7,"Code":"046 (327)"},{"Id":8,"Code":"047 (368)"}],"Speakers":[{"Id":13,"FirstName":"Aleksandar","LastName":"Totović","Bio":"\u003cp\u003eAleksandar Totović je 4 godine bio MVP za Microsoft Dynamics NAV, ali je\u0026nbsp;odustao od ovog statusa\u0026nbsp;zbog\u0026nbsp;angažovanja u kompaniji Microsoft, gde se trenutno nalazi na poziciji Partner Technology Strategist za Dynamics ERP re\u0026scaron;enja u multicountry regionu.\u0026nbsp;U dugoj karijeri je bio na većini pozicija u ERP biznisu, od konsultanta, preko project managera do menadžerskih pozicija. U prethodnom periodu je pokrenuo i ERP Magazin čiji je glavni i odgovorni urednik i bio u prvoj godini postojanja.\u003c/p\u003e\r\n\r\n\u003cp\u003eRadio je na puno različitih projekata u zemljama regiona, ali u drugim zemljama zapadne Evrope i Amerike. Dugo je držao treninge \u0026scaron;irom Evrope na teme NAV-a i PowerShella i Azurea, odnosno Office 365. Pored ovih tema, održao je dosta treninga vezano za Project Management u implementaciji ERP re\u0026scaron;enja. Aktivni je učesnik tima koji prati razvoj novih verzija NAV-a, vi\u0026scaron;e godina unazad. Vi\u0026scaron;e od 10 godina je u NAV-u, a vi\u0026scaron;e od 30 godina u IT-u (od detinjstva).\u003c/p\u003e\r\n\r\n\u003cp\u003ePredavač je na mnogim značajnim konferencijama u zemlji i inostranstvu (Directions EMEA, Directions NA, NAV TechDays, Sinergija, MS Network, WinDays, In Touch, SPC Adriatics, Tarabica, interni Microsoft Eventi,...) i autor vi\u0026scaron;e oficijelnih kurseva za NAV2015 i NAV2016. Aleksandar je jedan od nekoliko autora \u0026lsquo;How Do I\u0026hellip; in NAV\u0026rsquo; video materijala, a takođe je\u0026nbsp;i veoma aktivan i čitan bloger. Na Microsoft Convergence Europe 2014 je nagrađen sa Community Champion Award. Dugo je bio član komiteta i jedan od koautora najnovijih ispita za NAV, ali je zbog svog profesionalnog angažmana prepustio ove pozicije mlađim ljudima u globalnom communitiju.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/13.jpg","Company":"Microsoft Software d.o.o."},{"Id":15,"FirstName":"Predrag","LastName":"Jelesijević","Bio":"\u003cp\u003ePredrag Jelesijević radi u Računskom centru Elektrotehničkog fakulteta u Beogradu gde je poslednjih 7 godina na poziciji sistem administratora i predavača u Мicrosoft akademiji Elektrotehničkog fakulteta. Jedan je od lead-ova ITPro Serbia korisničke grupe i sa kolegama koordinira rad Microsoft community-ja u Srbiji. Microsoft mu je ove godina dodelio status Most Valuable Professional \u0026ndash; MVP, a nosilac je i velikog broja tehničkih certifikata. Po struci je dip. ing. Elektrotehnike.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/15.jpg","Company":"Računski centar Elektrotehničkog fakulteta u Beogradu"},{"Id":27,"FirstName":"Zoran","LastName":"Horvat","Bio":"\u003cp\u003eOsnivač i glavni konsultant u Coding Helmet Consultancy s.p.r.l., autor vi\u0026scaron;e kurseva na pluralsight.com, stručnjak za arhitekturu i dizajn softvera, nezavisni predavač i trener. Zoran Horvat ima vi\u0026scaron;e od 15 godina iskustva u razvoju softvera. Od 2014. je i autor na pluralsight.com gde trenutno priprema niz video kurseva iz oblasti testiranja i razvoja softvera. Aktivan je među domaćim i stranim firmama gde redovno održava treninge za razvojne timove po programu predavanja koji je sam razvio.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/27.jpg","Company":"Coding Helmet Consultancy s.p.r.l."},{"Id":44,"FirstName":"Omar","LastName":"Kudović","Bio":"\u003cp\u003ePosjeduje iskustvo preko 15 godina, u kojem je većinu vremena proveo na instalacijama i integracijama Windows Server, Exchange Server, Skype4B i Office365 platformi. Posljednjih nekoliko godina aktivno radi na raznim projektima implementacije rije\u0026scaron;anja za Skype For Business / Exchange u poslovnom okruženju, s velikim fokusom na cloud rije\u0026scaron;enja. Svoja iskustva predstavljao je na Microsoft Network, Microsoft Community Conference, Microsoft TechDays, KulenDayz, Microsoft Indeed Bulgaria, ATD i Sinergija konferencijama. Također je aktivan član MS Community BiH i lider \u0026quot;NewOffice\u0026quot; user grupe. Od 2013.\u0026nbsp;četiri puta nagrađen od strane Microsoft s MVP titulom za Skype For Business. Vodi i uređuje blog o Lync Server / Skype For Business (\u003ca href=\"http://kingdomoflync.wordpress.com\"\u003ehttp://kingdomoflync.wordpress.com\u003c/a\u003e) i pasionirani ljubitelj Hi Fi, vina, muzike i rockabilly kulture.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/44.jpg","Company":"Microsoft BiH"},{"Id":1096,"FirstName":"Sergey","LastName":"Olontsev","Bio":"\u003cpre\u003e\r\nI have been working with SQL Server since SQL Server 2000 version as a database administrator, developer, consultant and trainer, focusing on high availability and disaster recovery solutions, ETL, troubleshooting and performance tuning, developing high performance solutions. I\u0026#39;m a regular speaker at SQL Server user group meetings, SQL Saturday events and other conferences. An owner of MCM certification and MVP award on SQL Server.\u003c/pre\u003e\r\n","PictureUrl":"Content/Images/Speakers/1096.jpg","Company":"Kaspersky Lab"},{"Id":8,"FirstName":"Stanko","LastName":"Nikolić","Bio":"\u003cp\u003eStanko Nikolić dipl. inženjer elektrotehnike, Visual Studio and Dev Technologies MVP. Zaposlen je u kompaniji Merit Solutions. Profesionalno se bavi implementacijom savremenih softverskih re\u0026scaron;enja i istraživanjem novih tehnologija. Najvi\u0026scaron;e se bavi Microsoft tehnologijama i redovan je predavač na Microsoft konferencijama i skupovima. Radi kao projektant na nekoliko najvećih Windows Phone i Cross-platfrom projekata u Srbiji.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/8.jpg","Company":"Merit Solutions, Inc."},{"Id":1089,"FirstName":"Vlatko","LastName":"Ivanovski","Bio":"\u003cp\u003e\u003cspan style=\"color:rgb(136, 136, 136); font-family:segoe ui regular,segoe ui,helvetica neue,arial,sans-serif; font-size:14px\"\u003eMicrosoft MVP (Visual Studio ALM). Over 16 years of IT experience in Development Area and strong technical background have provided a strong business foundation in Managing ICTs. I am highly experienced IT Systems professional with proven management and technical skills and demonstrated the ability to build/lead/mentor teams of other IT technical personnel in different IT functions. Proven business analysis and business intelligence skills as well as the ability to see both the big picture and detailed view have constantly been a valuable asset in all situations. Large experience in planning, design and implementation of software solutions in the areas of e-Commerce, e-Business, e-Banking and e-Government, based on Microsoft technologies / systems. Continuously explore and implement practices to successfully manage the overall process of developing software solutions using the latest technologies and systems. As an DevOps \u0026amp; Agile Delivery Engineer, I am responsible for setting up and configuring the environments for applications and working with the architects and developers to ensure the best environment design is selected. I am also responsible for using monitoring and logging to ensure the application performs well.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1089.jpg","Company":"Avanade UK"},{"Id":2200,"FirstName":"Mustafa","LastName":"Toroman","Bio":"\u003cp\u003eMustafa Toroman je uposlen u kompaniji\u0026nbsp;Authority Partners\u0026nbsp;kao sistem inžinjer. Certificirani je MCSA, MCSE, MCTS, MCITP, MCP, MCS, MCT\u0026nbsp;i Microsoft P-Seller. Predavač na nekoliko konferencija kao \u0026scaron;to su to MS NetWork, MSCommunity BiH konferencija, Techday 2015, Tarabica, Kulendayz, Sinergija, Advanced Technology Days\u0026nbsp;itd. Redovan predavac na MS Community\u0026nbsp;Sarajevo UG. Od\u0026nbsp;2016. Microsoft MVP za Microsoft Azure.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/2200.jpg","Company":"Authority Partners"},{"Id":5250,"FirstName":"Nenad","LastName":"Sljivic","Bio":"\u003cp\u003eMicrosoft Certified Trainer se preko 20 godina praktičnog i teoretskog iskustva u informacionim tehnologijama. Po zanimanju diplomirani masiniski inzenjer. Treniutno radi u Microsoft-u na\u0026nbsp;poziciji Partner Technology Strategist za Dynamics\u0026nbsp;365 / CRM re\u0026scaron;enja u CEE Multicountry regionu.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5250.jpg","Company":"Microsoft"},{"Id":5260,"FirstName":"Danica","LastName":"Nikolic","Bio":"\u003cp\u003e\u003cspan style=\"font-family:arial,sans-serif\"\u003eProfessional software engineer in test, with focus on creating test script for automation and manual testing. Apart from buzzwords, I love software testing, I am eager to learn and grow and always curious about adopting new technologies.\u003c/span\u003e\u003cbr /\u003e\r\n\u003cbr /\u003e\r\n\u003cspan style=\"font-family:arial,sans-serif\"\u003eI have almost 5 years of experience in software testing, but I have no problem with getting my hands dirty with leading QA team and managing internal projects. Technologies and areas of my expertise include:\u003c/span\u003e\u003cbr /\u003e\r\n\u003cspan style=\"font-family:arial,sans-serif\"\u003e\u0026bull; Load and Performance testing, Regression testing, Functional and non-functional testing, Risk-Based testing, Exploratory testing, Continuous integration\u003c/span\u003e\u003cbr /\u003e\r\n\u003cspan style=\"font-family:arial,sans-serif\"\u003e\u0026bull; Selenium, TestComplete , Xamarin Test Cloud, Ranorex, LoadUI, SoapUI, LoadUIWCFStorm.Rest,\u0026nbsp;\u003c/span\u003e\u003cbr /\u003e\r\n\u003cspan style=\"font-family:arial,sans-serif\"\u003e\u0026bull; Team Foundation Server, Microsoft Test Manager\u003c/span\u003e\u003cbr /\u003e\r\n\u003cbr /\u003e\r\n\u003cspan style=\"font-family:arial,sans-serif\"\u003eAlso, I am experienced with Agile development/Scrum methodology and active user of project management tools TFS and Jira. I am familiar with basic concepts of Java, PHP, SQL and object-oriented programming generally. Nevertheless, I am regularly making an effort to broaden the list of my skills related to web/mobile software testing.\u003c/span\u003e\u003cbr /\u003e\r\n\u003cbr /\u003e\r\n\u003cspan style=\"font-family:arial,sans-serif\"\u003eEnough of formal, I am an avid traveler and kick-boxer and looking forward to travel the world.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5260.jpg","Company":"Merit Solutions d.o.o."},{"Id":5238,"FirstName":"Anton","LastName":"Boyko","Bio":"\u003cp\u003eFounder and main speaker at Ukrainian Microsoft Azure Community. 10+ years in application development. Builds apps based on Microsoft Azure platform since 2011. Microsoft Azure technical expert. During free time creates new videos about Microsoft Azure for his own YouTube channel. Microsoft Azure MVP since 2014. Owner and one of the organizers of the most popular Microsoft Azure conferences in Ukraine: Azure Day and Global Azure Bootcamp\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5238.jpg","Company":null},{"Id":1052,"FirstName":"Srđan","LastName":"Stević","Bio":"\u003cp\u003eSrđan Stević je MCP je od 2003. Dugi niz godina se bavi sistemskom administracijom, projektovanjem, implementacijom i podr\u0026scaron;kom za Microsoft tehnologije (Windows Server, Active Directory, Exchange Server, Hyper-V, DirectAccess, RDS, Failover clustering). Zaposlen je kao sistem administrator na Učiteljskom fakultetu u Beogradu. Jedan je od lead-ova ITPro Serbia korisničke grupe i sa kolegama koordinira rad Microsoft community-ja u Srbiji. Predsednik je udruženja \u0026ldquo;Tarabica IT konferencija\u0026ldquo;. Microsoft ga je 2015. godine nagradio titulom MVP za Office 365 platformu. Svakodnevno ga možete pratiti na http://twitter.com/srdjanstevic, a bloguje na http://srdjanstevic.wordpress.com.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1052.jpg","Company":"Univerzitet u Beogradu, Učiteljski fakultet"},{"Id":5253,"FirstName":"Matija","LastName":"Lah","Bio":"\u003cp\u003eMatija Lah has more than\u0026nbsp;fifteen ears\u0026nbsp;of experience working with Microsoft SQL Server, mostly architecting data-centric solutions in the legal domain. His contributions to the SQL Server community have led to the Microsoft Most Valuable Professional award in 2007 (Windows Server System SQL Server). In 2008 Matija joined SolidQ as a Mentor, located in Central and Eastern Europe. He spends most of his time on projects involving advanced information management, and natural language processing.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5253.jpg","Company":"SolidQ CEE"},{"Id":25,"FirstName":"Damir","LastName":"Dizdarevic","Bio":"\u003cp\u003eDamir Dizdarević po struci je diplomirani matematičar-informatičar, i radi kao izvr\u0026scaron;ni direktor za usluge u kompaniji Logosoft d.o.o.,te kao predavač i autor MOC kurseva.\u003cbr /\u003e\r\nPored toga, povremeno radi i kao sistem dizajner za kompleksnija enterprise okruženja. Osnivač je i voditelj bosansko-hercegovačkog Microsoft Community-a. Sa Microsoft server platformama radi već zadnjih 20 godina, a posebno se specijalizirao se za Windows Server, Exchange Server, Security, mobilna i virtualizacijska re\u0026scaron;enja. Za doprinose u preno\u0026scaron;enju znanja o Microsoft server proizvodima, rad u community-u te veliki broj održanih predavanja, Microsoft mu je prije 8 godina dodijelio status Most Valuable Professional \u0026ndash; MVP, a nosilac je i velikog broja tehničkih certifikata (MCSE,MCTS,MCITP,MCT) za Office365, System Center , Windows Server, Exchange Server te Hyper-V. Redovno predaje na mnogim Microsoftovim i drugim IT konferencijama u regiji.\u0026nbsp;Na konferenciji Microsoft Sinergija u sedam prethodnih godina za redom bio je jedan od tri najbolja predavača po ocjenama publike. Jedan je od rijetkih predavača iz Evrope koji radi kao autor i recenzent oficijelnih MOC kurseva. U ovoj godini intenzivno je angažovan na izradi serije oficijelnih kurseva za Windows 10, EMS, novi Windows Server i Exchange. Pored toga, jedan je od rijetkih autora iz \u0026scaron;ireg regiona koji objavljuje i stručne tekstove u prestižnom Windows ITPro Magazinu (neki od tekstova su dostupni na : http://windowsitpro.com/author/damir-dizdarevic). Njegov blog o Microsoft Server proizvodima i Microsoft Learning programu dostupan je na http://dizdarevic.ba/ddamirblog.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/25.jpg","Company":"Logosoft d.o.o. Sarajevo"},{"Id":1132,"FirstName":"Bernardin","LastName":"Katic","Bio":"\u003cp\u003e\u003cspan style=\"background-color:rgb(235, 235, 235); color:rgb(136, 136, 136); font-family:segoe ui regular,segoe ui,helvetica neue,arial,sans-serif; font-size:14px\"\u003eNakon uzbudljivih i zabavnih profesionalnih početaka na razvoju računalnih igara u assembleru, diplome na područuju operacijskih sustava realnog vremena te izazovnog razvoja ekspertnih sustava, zadnjih godina se posvetio puno manje zabavnom, ali i dalje vrlo izazovnom dizajnu i razvoju sustava za financijsku industriju te njihovoj integraciji u enterprise okruženjima. U predahu od svakodnevnog posla vodi lokalni Microsoftov Community. Razvoj igara ga je naučio da je svaki byte i svaki takt procesora bitan, pa mu je najveće zadovoljstvo optimizirati sustave te iskoristiti sve raspložive resurse i postići da sustavi rade brže, bolje i kvalitetnije. Kao svaki pravi Slavonac, zaljubljenik je u skijanje, a u slobodno vrijeme nastoji pobolj\u0026scaron;ati time management i provesti \u0026scaron;to vi\u0026scaron;e vremena s obitelji. Bernardin je nagrađen od strane Microsofta nagradom MVP - Most Valuable Professional za Visual C#/.net\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1132.jpg","Company":"Hammer"},{"Id":5229,"FirstName":"Sergiy","LastName":"Lunyakin","Bio":"\u003cp\u003e\u003cspan style=\"color:rgb(0, 0, 0); font-family:arial,sans-serif,helvetica; font-size:11px\"\u003eI\u0026#39;m a Data Platform MVP and a DWH/BI Consultant at ITMagination Inc. Responsible for designing and developing Datawarehouse and BI solutions with using on-premises Microsoft products and Azure cloud. I like helping others with their problems with Microsoft SQL Server and all MS BI stack, sharing my knowledge is another passion of me. I\u0026#39;m a regular presenter at other conferences and user groups, including 24Hours of PASS, SQLSaturday and PASS Local chapter meetings.\u0026nbsp;\u003c/span\u003e\u003cbr /\u003e\r\n\u003cspan style=\"color:rgb(0, 0, 0); font-family:arial,sans-serif,helvetica; font-size:11px\"\u003eI also run the Lviv SQL Server User Group in Ukraine and organize SQLSaturday Lviv.\u003c/span\u003e\u003cbr /\u003e\r\n\u003cspan style=\"color:rgb(0, 0, 0); font-family:arial,sans-serif,helvetica; font-size:11px\"\u003eI have certificates MCSE - Data Management and Analytics, MCSA - Cloud Platform, MCP, MCTS.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5229.jpg","Company":"ITMagination"},{"Id":5242,"FirstName":"Andrea","LastName":"Jerinic","Bio":"\u003cp\u003eQA engineer working at company Vega It Sourcing, in Novi Sad.\u003c/p\u003e\r\n\r\n\u003cp\u003eI have graduated from the Faculty of Philosophy, Department of Journalism. I worked for several years as a journalist. I have been avery good at my job, always investigating, researching, searching... for soemthing new that can occupy the readers. However, after some time, I\u0026#39;ve realized that I was still looking for my \u0026quot;place under the Sun\u0026quot;. So I\u0026#39;ve enrolled at the new college, Higher Technical School of Professional Studies, Department of Information Technology, and discovered the world of coding, programming, testing. In it, I am successfully swimming even though I was more oriented to social sciences during high school days.\u003c/p\u003e\r\n\r\n\u003cp\u003eLast year (2016), I got a proposal to hold a lecture at first Serbian Test Conference, which was held in Belgrade and organised by Supernova Events. I was honored to be part of this event, because, for the first time, Serbia got a meetup place where QA engineers could share and gather the knowledge. Also, I was one of the people contributing in creation of agenda.\u003c/p\u003e\r\n\r\n\u003cp\u003eAlso, I took a lecture at Ignite event in Novi Sad, \u0026quot;Women in IT\u0026quot;, where I have presented the role of QA engineer walking in ladies shoes.\u003c/p\u003e\r\n\r\n\u003cp\u003eI think that QA engineers are the team members who must have wide knowledge (of several programming languages, back-end and front-end, testing tools, sql...) in order to find issues in application/software and therefor make sure that quality of it is as expected (and more). Buggy day, my favourite day ;)\u003c/p\u003e\r\n\r\n\u003cp\u003eAt the moment, I am spreading my knowledge related to front-end development and I have enrolled the master studies of Digital Forenzics. I hope that, one day, I will get an opportunity to make a sinergy from all of the fields of my interests.\u003c/p\u003e\r\n\r\n\u003cp\u003eIf someone thinks that I am just learning, learning, learning... Well, maybe he/she is right :) But, that\u0026#39;s not all! I am vey sportive. I have trained basketball for many years and now I am long distance runner.\u003c/p\u003e\r\n\r\n\u003cp\u003eThe quote that I really like is: \u0026quot;The truth runs marathons. The lie runs sprints.\u0026quot;\u003c/p\u003e\r\n\r\n\u003cp\u003eI think that, if you want to make something from yourself, you have to take a long run, be persistent, stubborn and patiente.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5242.jpg","Company":"Vega IT Sourcing"},{"Id":5269,"FirstName":"Nebojša","LastName":"Ilić","Bio":"\u003cp\u003eInženjer informatike sa 25 godina iskustva u radu sa bazama podataka. Prvih pet godina učestvovao u projektima na različitim RDBMS -\u0026nbsp;Oracle, Informix i Sybase. Sa SQL serverom od verzije 6.5. ETL je predmet interesovanja i rada duže od 10 godina. Radio sa DTS, SSIS kao i TDI. Poslednjih pet godina usmeren na BI re\u0026scaron;enja. I sve to u okviru SQL platforme.\u003c/p\u003e\r\n\r\n\u003cp\u003eRadio kao DB developer, projektant\u0026nbsp;i administrator u mnogim firmama među kojima je i pozicija administratora na Olimpijskim igrama. Poslednjih desetak godina\u0026nbsp;zaposlen kao administrator u NBS.\u003c/p\u003e\r\n\r\n\u003cp\u003eTrenutno zaokupljen implementacijom HADR re\u0026scaron;enja na SQL 2016.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5269.jpg","Company":"NBS"},{"Id":1144,"FirstName":"Toni","LastName":"Petrina","Bio":"\u003cp\u003e\u003c!--StartFragment--\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003eToni Petrina nositelj je titule Microsoft MVP za C#. Biv\u0026scaron;i ekspert za QBASIC u svom razredu danas se bavi C#-om i JavaScriptom i poku\u0026scaron;ava uvjeriti kolege u blagodati funkcijskog programiranja. Jednom kad mu uspije neki startup posvetit će svoj život \u0026scaron;irenju F# i LISP koda, u međuvremenu radi na novim projektima i Xamarin mobilnim aplikacijama. Bloga, forumira i redovito predaje na regionalnim konferencijama i User Grupama. Pobornik je otvorenih tehnologija, Open Sourcea i čokoladnih proizvoda. Kad ne pi\u0026scaron;e kod, pi\u0026scaron;e blog ili proučava nove tehnologije, slobodno vrijeme provodi s djevojkom, prijateljima i na raznim hobijima..\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003c!--EndFragment--\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003c!--EndFragment--\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1144.jpg","Company":"Massive Pixel"},{"Id":2188,"FirstName":"Tomislav","LastName":"Lulić","Bio":"\u003cp\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003eLive\u0026nbsp;in Zagreb, Croatia. \u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003eSpent years creating harmony between people, processes, technologies, and budgets. Several years ago, discovered cloud computing, including Office 365, Azure and related solutions. \u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003eReceived Microsoft MVP for Office Servers and Services (Office 365). Proficient with MS licensing. \u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003eEnjoys accordion concerts, rarely misses a hockey game by favorite club KHL Medve\u0026scaron;čak. \u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003eFrequent l\u003c/span\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003eecturer at conferences, e.g., Advanced Technology Day, Windays, MSNetworks, KulenDayz, MS Sinergija, and various IT communities. Leads EDU ITPRO and NewOffice Microsoft user groups.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/2188.jpg","Company":"Hapovel"},{"Id":1109,"FirstName":"Can","LastName":"Bilgin","Bio":"\u003cp\u003eCan Bilgin currently works in Authority Partners as a Program Architect. He has been working in the software industry, primarily with Microsoft technologies, for over a decade and has been recognized as a Microsoft Most Valuable Professional for his technical contributions. In this period he took key roles in projects for high profile clients using technologies such as BizTalk, SharePoint, Dynamics CRM, Xamarin, WCF and other web technologies. His main passion lies in mobile and IoT development using the modern toolset available for developers. He tries to share his experience on his blog (http://canbilgin.wordpress.com), social media (@can_bilgin) and through speaking engagements in both local and international conferences and community events in the Balkan region.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1109.jpg","Company":"Authority Partners Inc."},{"Id":2220,"FirstName":"Marko","LastName":"Lazić","Bio":"\u003cp\u003eMarko Lazić radi kao softverski inženjer u kompaniji Merit Solutions. Primarno je fokusiran na razvoj web i cross-platform mobilnih aplikacija kori\u0026scaron;ćenjem najnovijih tehnologija. Poslednje 3 godine aktivno radi na Xamarin platformi. Diplomirao je na Elektrotehničkom fakultetu u Beogradu.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/2220.jpg","Company":"Merit Solutions"},{"Id":1092,"FirstName":"Luka","LastName":"Manojlovic","Bio":"\u003cp\u003eLuka Manojlovic has been working in IT for more than 13 years - mostly engaged on infrastructure project on Microsoft platform. Luka is\u0026nbsp;currently working on virtualization and storage implementations and migrations from other virtualization platforms. His company MA-NO d.o.o. supports around 50 companies in Slovenia and abroad. Luka is MVP since 2008 and has been presenting in all mayor conferences in the region.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1092.jpg","Company":"MA-NO d.o.o."},{"Id":1061,"FirstName":"Dragoslav","LastName":"Ogar","Bio":"\u003cp\u003eDragoslav Ogar je direktor/konsultant/predavač preduzeća A4ATCP d.o.o. Beograd, koje je zvanični Microsoftov partner. Ima vi\u0026scaron;e od 28 godina praktičnog i teoretskog iskustva u informacionim tehnologijama. Po zvanju je profesor matematike. Poseduje desetak zvaničnih MS titula od kojih je verovatno najznačajnija MVP for SQL Server.\u003c/p\u003e\r\n\r\n\u003cp\u003eKao Microsoftov trener, održao je vi\u0026scaron;e od 70 MOC-ova i preko 15.000 časova. Danas, najče\u0026scaron;će pravi sopstveni materijal (vežbe i primere) za konsultacije i radionice.\u003c/p\u003e\r\n\r\n\u003cp\u003eDragoslav je najče\u0026scaron;će nagrađivani predavač na Microsoftovim konferencijama u Srbiji. Na četiri međunarodne Microsoftove konferencije (Sinergija 04, 06, 10, 11 i 13), nagrađen je kao jedan od tri najbolja predavača.\u003c/p\u003e\r\n\r\n\u003cp\u003eOsim tema iz SQL Server oblasti, omiljene teme su mu i Entity Framework, OData, MVC i SOLID.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1061.jpg","Company":"A4ATCP"},{"Id":5254,"FirstName":"Slavko","LastName":"Kukrika","Bio":"\u003cp\u003eLjudi koji znaju Slavka Kukrika slažu se da ga nije jednostavno opisati u nekoliko rečenica. Slavko je Microsoft certificiran predavač (MCT), konsultant i autor vi\u0026scaron;e knjiga o Microsoft tehnologijama. Sa Microsoft proizvodima radi vi\u0026scaron;e od 20 godina i specializirao se za Windows platformu, virtualizaciju i Microsoft Azure. Radio je na vi\u0026scaron;e projekata koji uključuju on-premises i cloud re\u0026scaron;enje, a sudelovao je i u pripremi certifikacije za Windows Server 2016. Slavko poseduje mnoge tehničke certifikate, medju kojima je posebno ponosan na titulu Microsoft Most Valuable Professional (MVP). U privatnom životu Slavko je ponosan otac dva sina, koji svaki dan poku\u0026scaron;ava da produži na bar 25 sata.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5254.jpg","Company":"Avtenta.si"},{"Id":1048,"FirstName":"Ivan","LastName":"Lazarević","Bio":"\u003cp\u003eIvan Lazarević radi na poziciji Solution Architect u kompaniji S\u0026amp;T Serbia, gde na brojnim projektima učestvuje kao programer, arhitekta, team leader. Od 2009. godine je sertifikovani Scrum Master. Poseduje MCP, MCTS, MCSD serfifikate. Kroz svoj rad nastoji da primeni agilne metodologije u projektima na kojima učestvuje i promovi\u0026scaron;e takav način razmi\u0026scaron;ljanja. Poseban deo interesovanja su mu izučavanje arhitektura složenih softverskih re\u0026scaron;enja, agilne metodologije, TDD, savremeni softverski alati, različiti programski jezici. Trenutno je angažovan na razvoju aplikacija kori\u0026scaron;ćenjem Microsoft-ovih tehnologija (.NET Framework, ASP.NET MVC-a, EF...), integraciji različitih sistema i Mobility re\u0026scaron;enjima. Od 2005. godine radi na Fakultetu organizacionih nauka u Beogradu kao saradnik u nastavi na predmetu Projektovanje softvera na katedri za Softversko inženjerstvo, programski jezik C#.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1048.jpg","Company":"S\u0026T Serbia"},{"Id":41,"FirstName":"Vladimir","LastName":"Marković","Bio":"\u003cp\u003eVladimir has comprehensive experience in DW/BI design and development primarily based on Microsoft and SAS BI platforms and products. This experience is further bolstered by years of working in implementation and development different kinds of DW/BI solutions and products.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"line-height:1.6\"\u003eDuring his work in the bank, he\u0026rsquo;s gained broad business background in different fields of BI application especially in analytical customer intelligence, credit risk scoring, credit risk portfolio management and accounting.\u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"line-height:1.6\"\u003eHe is an experienced trainer and presenter.\u0026nbsp; He enjoys sharing enthusiasm by presenting and promoting DW/BI at courses, user groups, technical events and conferences.\u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"line-height:1.6\"\u003eVladimir holds a MSc in Math and Computer Science from Faculty of Mathematics, University of Belgrade . Areas of his interest are dimensional modeling and data mining.\u0026nbsp; He plays chess in his free time.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/41.jpg","Company":"Banka Intesa AD Beograd"},{"Id":1111,"FirstName":"Dubravko","LastName":"Marak","Bio":"\u003cp style=\"text-align: justify;\"\u003eDubravko Marak works in IT industry more than 15 years. During his career he was working with Microsoft Technologies starts from Windows Server NT 4.0 till current 2012 R2. He is active member of Croatian ITPro community. He is also one of regular speakers on Microsoft conferences in SEE region (Sinergija, MS NetWork, MobilityDay and MVP Fusion). He is also present as a speaker on other events which is relying on Microsoft technologies. On Sinergija 12 he was second best speaker and he had most visited presentation. From past projects can be highlighted migration from NT 4.0 and Exchange 5.5 to Windows 2003 family, several infrastructure migrations to higher domain levels and merge of two large German Telecom (20k+ users). He\u0026rsquo;s most challenging project was building DR site based completely on Microsoft Technologies (from blueprint to finishing). Currently he is playing infrastructure architect role at the clients.\u003cbr /\u003e\r\nHe is MVP\u0026nbsp;four\u0026nbsp;years in a row (since 01.10.2012)\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1111.jpg","Company":"GCON GmbH"},{"Id":5247,"FirstName":"Rastko","LastName":"Đorđević","Bio":"\u003cp\u003e\u003cspan style=\"font-family:verdana,geneva,sans-serif\"\u003e\u003cspan style=\"color:rgb(34, 34, 34); font-size:12px\"\u003eRastko Đorđević ima 14 godina i učenik je 8. razreda Osnovne \u0026scaron;kole. Fokusiran je na Microsoft-ove tehnologije, pogotovo Windows IoT i Cross Platform Mobile Development koristeći Xamarin, ali u skorije vreme se i intenzivno bavi i robotikom. Uglavnom koristi C# za programiranje, ali voli da eksperimenti\u0026scaron;e i uči nove programske jezike.\u0026nbsp;\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5247.jpg","Company":"Student"},{"Id":59,"FirstName":"Wekoslav","LastName":"Stefanovski","Bio":"\u003cp\u003eWekoslav Stefanovski has over a decade of professional developer experience using a variety of development technologies. He has been using .net and C# to build enterprise-level applications since the first public beta, and JavaScript since the turn of the century. Areas of special interest include functional programming, static code analysis, code quality metrics, performance optimization and refactoring.\u003c/p\u003e\r\n\r\n\u003cp\u003eCurrently works in Sourcico as a Head of Development.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/59.jpg","Company":"Sourcico"},{"Id":1088,"FirstName":"Ondrej","LastName":"Sevecek","Bio":"\u003cp\u003eProud MCM:Directory and not less proud MVP:Enterprise Security from Brno, Czechia doing AD, security, identity management and integration, PKI. Also digs into hacking and doing security auditing as CISA and CISM.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1088.jpg","Company":null},{"Id":46,"FirstName":"Aleksandar","LastName":"Nikolić","Bio":"\u003cp\u003eAleksandar Nikolić je Microsoft Most Valuable Professional za Cloud and Datacenter Management i Microsoft Azure, osnivač \u003ca href=\"http://PowerShellMagazine.com\"\u003ePowerShellMagazine.com\u003c/a\u003e i administrator portala \u003ca href=\"http://PowerShell.com\"\u003ePowerShell.com\u003c/a\u003e. Uz 17-godi\u0026scaron;nje iskustvo na poslovima sistem administracije i automatizacije, tokom poslednjih\u0026nbsp;6 godina fokusiran je na Windows PowerShell i Microsoft Azure\u0026nbsp;obuke i prezentovanje na Microsoftovim i drugim IT konferencijama u regionu, Evropi i Americi.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/46.jpg","Company":"PowerShell Magazine"},{"Id":5246,"FirstName":"Boris","LastName":"Hristov","Bio":"\u003cp\u003eBoris is the Founder of\u0026nbsp;\u003ca href=\"https://www.356labs.com/\"\u003e356labs\u003c/a\u003e\u0026nbsp;- a boutique presentation design \u0026amp; training agency. He has delivered sessions in 25+ countries and has been rated as \u0026quot;Top Speaker\u0026quot; numerous times. Boris has years of experience as a trainer and has trained and coached not just students, but also people from the IT, sales, marketing and managment field in topics ranging from presentation skills and storytelling through the psychology behind slide design.\u003c/p\u003e\r\n\r\n\u003cp\u003eHe founded 356labs in September 2015 and less than 2 years later, his company now works for brands like Deutsche Telekom, KPMG, Unicredit Bulbank, PwC, Roche and a lot more, helping them prepare and deliver truly effective presentations. In 2016, 356labs also became the only presentation agency in the world to speak at the biggest yearly conference of Microsoft - Microsoft Ignite - which was held in Atlanta and had more than 25 000 vistors.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5246.jpg","Company":"356labs"},{"Id":2196,"FirstName":"Romeo","LastName":"Mlinar","Bio":"\u003cp\u003eRadi na mjestu Microsoft sistem arhitekta. Računalnom tehnologijom bavi se proteklih 15 godina. Najveća strast vezana mu je uz Microsoftove proizvode i tehnologije poput System Center alata, automatizacije procesa i izgradnje IT sustava, te servisa Windows Servera, a najvi\u0026scaron;e vremena posvećuje Hyper-V virtualizacijskoj platformi i svemu vezanom za virtualizaciju. Od 2012. godine nositelj je Microsoftove titule Most Valuable Professional (MVP) za Cloud and Datacenter Management [Hyper-V] kao i velikog broja Microsoftovih industrijskih certifikata vezanih za sistemsku administraciju. Redovni je predavač na regionalnim IT konferencijama, Microsoft IT Pro korisničkim grupama, a u posljednje vrijeme sve vi\u0026scaron;e i izvan regije. Također, voditelj je IT Pro i EDU IT Pro\u0026nbsp;User grupa Zagreb. U slobodno vrijeme druži se s ljudima iz IT svijeta, stječe nova znanja i vrlo rado ih dijeli s ostalima, a u ostatku slobodnog vremena uživa sa svojom obitelji.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/2196.jpg","Company":"Hattrick SG ltd."},{"Id":5267,"FirstName":"Igor","LastName":"Janošević","Bio":"\u003cp\u003eIgor Jano\u0026scaron;ević radi u računraskom centru Arhitektonskog fakulteta od 2011. godine, a sistem administracijom se bavi poslednje tri i po godine. Stara se o kombinovanom Linux \u0026ndash; Microsoft produkcijskom okruženju koje je uglavnom virtalizovano kori\u0026scaron;ćenjem Hyper-V tehnologije, a u kojem je implementiran Microsfot AD, Exchange server,SharePoint FreeRADIUS, itd. \u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003ePo struci je diplomirani inženjer arhitekture.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5267.jpg","Company":"Arhitektonski fakultet u Beogradu"},{"Id":11,"FirstName":"Srđan","LastName":"Božović","Bio":"\u003cp\u003eSrđan Božović Microsoft MVP, MCT. Profesionalno se bavi programiranjem poslednjih petnaest godina. Trenutno je fokusiran na re\u0026scaron;enja koja povezuju Windows Azure platformu i mobilne uređaje bazirane na Microsoft platformi, Windows Phone i Windows 8. Voli da eksperimenti\u0026scaron;e sa različitim programskim jezicima. U aprilu 2009-te godine, postao je MVP za C#.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/11.jpg","Company":"Microsoft Srbija"},{"Id":55,"FirstName":"Miloš","LastName":"Stefanović","Bio":"\u003cp\u003eMilo\u0026scaron; Stefanović je diplomirao na smeru za informacione sisteme Fakulteta organizacionih nauka u Beogradu diplomskim radom u oblasti ERP sistema. Ima\u0026nbsp;8 godina iskustva u implementaciji ERP sistema. Zaposlen je u kompaniji NPS Beograd najpre na poziciji ERP developer, potom kao Team liedera razvojnog tima za Dynamics NAV, a trenutno je na poziciji Direktora razvoja.\u003c/p\u003e\r\n\r\n\u003cp\u003eMilo\u0026scaron; je Microsoft Certified IT Professional for Microsoft Dynamics NAV i aktivno je učestvovao na velikom broju lokalnih, regionalnih i međunarodnih projekata implementacije Microsoft Dynamics NAV re\u0026scaron;enja u svojstvu\u0026nbsp; programera, analitičara sistema i vođe projekta. Njegova porofesionalna interesovanja su vezana za integraciju ERP sistema sa externim aplikacijama, FIT/GAP analizu poslovnih procesa i management.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/55.jpg","Company":"NPS d.o.o."},{"Id":5241,"FirstName":"Mihail","LastName":"Mateev","Bio":"\u003cpre\u003e\r\nMihail Mateev is a  Solutions Architect, PM and Senior Technical Evangelist at Strypes, blogger, Microsoft Azure MVP, Regional Mentor at PASS \r\nMihail worked in various areas related to technology Microsoft: Desktop and WEB applications, MS SQL Server, Microsoft Azure, IoT solutions,\r\nMihail is administrator of many events like SQLSaturday Bulgaria, Sofia, Varna and Plovdiv, Azure Bootcamp Bulgaria, JS Saturday Bulgaria, SharePoint Saturday Bulgaria, UXify Bulgaria, jQuery Bulgaria,  JSTalks Bulgaria\u003c/pre\u003e\r\n","PictureUrl":"Content/Images/Speakers/5241.jpg","Company":"Strypes"},{"Id":2210,"FirstName":"Jovan","LastName":"Popovic","Bio":null,"PictureUrl":"Content/images/placeholders/person1-placeholder.png","Company":"Microsoft"},{"Id":5258,"FirstName":"Vladimir","LastName":"Ljubibratić","Bio":"\u003cp\u003eSeasoned Senior Manager, Business Development Manager, CRM practioner and Project Manager focused on improving business through usage of various IT technologies. Special interest in Microsoft Dynamics and Cloud business and collaboration solutions.\u003cbr /\u003e\r\n15+ years of experience leading teams. Managed 30+ projects ranging from \u0026euro;10K-\u0026euro;0.5M in budget. 300+ hours of presenting and training on a wide variety of subjects including software application, teamwork and project management. Strong functional and customization knowledge on Microsoft Dynamics CRM and Office productivity tools. 10+ years of experience in the areas of Requirements Gathering, Software Design and Development, and Business Process Analysis.\u003cbr /\u003e\r\n\u003cbr /\u003e\r\nAlso acting as Microsoft P-Seller (P-TSP) for Microsoft Dynamics CRM.\u003cbr /\u003e\r\n\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5258.jpg","Company":"Comtrade System Integration"},{"Id":50,"FirstName":"Igor","LastName":"Đerman","Bio":"\u003cp\u003e\u003cspan style=\"color:rgb(136, 136, 136); font-family:segoe ui regular,segoe ui,helvetica neue,arial,sans-serif; font-size:14px\"\u003eIgor Đerman je diplomirao u Beogradu 2005 godine, a trenutno je zaposlen u kompaniji Leversys kao Lead Software Engineer. Poslednjih 11 godina je obavljao niz uloga od developera preko team leader-a do lead inženjera na projektima vezanim za različite domene. Posebno se interesuje za softversku arhitekturu, powershell, scrum kao i funkcionalno programiranje. Poseduje MCPD sertifikaciju za WEB, kao MCTS za baze podataka. Angažovan \u0026scaron;to se tiče edukacije kao predavač na konferencijama u regionu i aktivan je član .NET korisničke grupe Beograd.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/50.jpg","Company":"Leversys RS d.o.o"},{"Id":36,"FirstName":"Dejan","LastName":"Pervulov","Bio":"\u003cp\u003eTechnical Evangelist u Microsoft-u. Kao tehnički konsultant učestvovao je na brojnim ERP, CRM i DWH/BI projektima u regionu. Razvojem na Microsoft tehnologijama bavi se već 18 godina i poseduje MCT, MCSD, MCDBA, MCTS, MCSA i MCITP sertifikate. Kao Microsoft Certified Trainer bio je angažovan na pripremi i održavanju obuka u vi\u0026scaron;e \u0026scaron;kolskih centara u Srbiji. Od oktobra 2014. godine je i Microsoft MVP za\u0026nbsp;Data Platform (SQL Server).\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/36.jpg","Company":"Microsoft"},{"Id":2214,"FirstName":"Vladimir","LastName":"Meloski","Bio":"\u003cp\u003eVladimir Meloski\u0026nbsp;je Microsoft Most Valuable Professional - MVP\u0026nbsp;za Office Server and Services, Microsoft Certified Trainer i konsultant za re\u0026scaron;enja iz oblasti\u0026nbsp;unified communications i server\u0026nbsp;infrastrukture i radi sa\u0026nbsp;tehnologijama\u0026nbsp;Microsoft Exchange Server, Skype for Business, Office 365\u0026nbsp;i Windows Server. Vladimir je diplomirani\u0026nbsp;eletkroinžener kompjuterskih nauka,\u0026nbsp;sa vi\u0026scaron;e od\u0026nbsp;20 godina profesionalnog iskustva u informatičkoj tehnologiji.\u0026nbsp;Involivran je\u0026nbsp;na Microsoft konferencijama u Evropi i Americi kao predavač, moderator, proktor za laboratorijske vežbe\u0026nbsp;i tehnički ekspert. Vladimir je\u0026nbsp;učestvovao u\u0026nbsp;timu za razvoj oficijalnih Microsoft kurseva\u0026nbsp;za Exchange Server 2016, 2013, 2010, 2007, Office 365 i Windows Server 2016 i 2012, i jedan je od autora knjige \u0026quot;Mastering Microsoft Exchange Server 2016\u0026quot;. Posvećen je razmeni\u0026nbsp;best practice-a, real-world iskustva, i znanja sa svjoim studentima i kolegama, i je community leader Makedonske IT Pro user grupe. Svoje slobodno vreme sa zadovoljstvom provodi u prirodi\u0026nbsp;sa svojim sinom i suprugom.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/2214.jpg","Company":"Meloski Consulting"},{"Id":5233,"FirstName":"Admir","LastName":"Tuzović","Bio":"\u003cp style=\"text-align: justify;\"\u003eAdmir se programiranjem bavi preko 20 godina. U svojoj karijeri pro\u0026scaron;ao je put od pravljenja aplikacija za MS-DOS u Borland C++ pa do planiranja arhitekture rje\u0026scaron;enja baziranih na Microsoft Azure platformi. Redovan je predavač na međunarodnim konferencijama a učestvovao je i u organizovanju značajnog broja događaja lokalnog karaktera za vrijeme svog angažmana kao Technical Evangelist pri Microsoft uredu u BiH. Trenutno je uposlen u kompaniji App Impact kao CTO. Admir je i Pluralsight autor.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5233.jpg","Company":"App Impact d.o.o. Sarajevo"},{"Id":1055,"FirstName":"Radovan","LastName":"Ostojić","Bio":"\u003cp\u003eProgramer i software arhitekt, sa specijalizacijom SharePoint i .Net.\u003c/p\u003e\r\n\r\n\u003cp\u003eRadio u EU institucijama tokom proteklih 6 godina.\u003c/p\u003e\r\n\r\n\u003cp\u003eTrenutno radi kao Sistem arhitekt u oblasti warehouse automation-a, za Vanderlande iz Holandije.\u003c/p\u003e\r\n\r\n\u003cp\u003eŽivi i radi u Beogradu.\u003c/p\u003e\r\n\r\n\u003cp\u003eOženjen, otac jednog deteta.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1055.jpg","Company":"ComTrade"},{"Id":5234,"FirstName":"Margarita","LastName":"Naumova","Bio":"\u003cp\u003e\u003cspan style=\"color:rgb(31, 73, 125)\"\u003eMagi Naumova is SQL Server Architect and Consultant, speaker and trainer, Microsoft Certified Master, Data Platform MVP, MCT, Founder of SQL Master Academy, founder and the leader of the Bulgarian SQL User group. She has more than 15 years SQL Server training and consulting experience. Magi is a former member of Microsoft Services Worldwide Technical Leadership Team, а Microsoft Women worth watching \u003c/span\u003e\u003ca href=\"http://zd.net/1lwNYKH\"\u003ehttp://zd.net/1lwNYKH\u003c/a\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"color:rgb(31, 73, 125)\"\u003eCurrently she is running her own consulting company focused entirely on SQL Server Data Platform. Her unique SQL Master Academy training program has helped hundreds of specialists to feel knowledgeable in their daily work or to find an inspirational career path in the world of SQL Server. \u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5234.jpg","Company":"SQL Master Academy /Inspirit"},{"Id":5285,"FirstName":"Bojan","LastName":"Mišić","Bio":"\u003cp\u003eBojan Mi\u0026scaron;ić je zaposlen u kompaniji Merit Solutions kao softverski inženjer. Izabran za Microsoft Student Partnera jo\u0026scaron; tokom studija se opredelio za najnovije tehnolgije na Microsoft-ovom stack-u. Danas profesionalno radi na klijentskim (cross-platform) aplikacijama na .NET platformi i iza sebe ima popriličan broj aplikacija na Windows Store-u. Pored programiranja, interesuju ga i \u0026nbsp;Machine Learning i ve\u0026scaron;tačka inteligencija, te u slobodno vreme poku\u0026scaron;ava da uhvati korak sa sve većim prisustvom ovih oblasti u svakodnevnom životu.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cspan style=\"color:rgb(102, 102, 102); font-family:segoe ui,ubuntu,sans-serif,helvetica neue,helvetica,arial,sans-serif\"\u003eDiplomirao je na Elektrotehničkom fakultetu u Beogradu.\u003c/span\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/5285.jpg","Company":"Merit Solutions, Inc."},{"Id":31,"FirstName":"Catalin","LastName":"Gheorghiu","Bio":"\u003cp\u003eCatalin Gheorghiu is a solution architect from Timisoara Romania. The current interests are in the area of (I)IoT, industrial mobile and cloud solutions. In addition to addressing the software development and architecture, is a trainer and consultant. In his spare time is member of the technical community, contributing with articles and blogs (signed MrSmersh), presentations to several user groups/meetups (also is RONUA Timisoara user group leader), and lecturing all over Romania and abroad.\u003cbr /\u003e\r\nSince 2011, every year he was awarded the Microsoft MVP Award.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/31.jpg","Company":"I Computer Solutions"}],"Sessions":[{"Id":2272,"Track":"DYN","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"Water-Agile-Fall metodologija u implementaciji Dynamics rešenja","Description":"\u003cp\u003eVrlo često se mogu ćuti sukobi u mi\u0026scaron;ljenju da li je bolje koristiti Watefall ili Agile metodologije u upravljanju projektima. Ista situacija vlada i kada se govori o ERP projektima, iako ovi projekti nisu ba\u0026scaron; standardni IT projekti. Ipak, iskusni vođa projekta neće tek tako reći da je bolja jedna ili druga metodologija, barem ne pre nego \u0026scaron;to sagleda kakav zapravo projekat u pitanju. U implementaciji ERP re\u0026scaron;enja, uobičajeno razvoj ne čini veći deo projekta (mada postoje i takvi projekti), a značajnog uticaja ima da li je definisan fiksni opseg ili da li su tro\u0026scaron;kovi fiksni ili ne... Činjenica je da ne možemo koristiti uvek istu metodologiju i na isti način u ovakvim projektima, pre svega jer su svi ti projekti razičiti. Zavisno od zahteva, tipa i količine razvoja, i drugih sličnih karakteristika, trebalo bi i da biramo metodologiju.\u003c/p\u003e\r\n\r\n\u003cp\u003eAli \u0026scaron;ta ako jedan potencijalni Dynamics projekat ima dobar deo karakteristika koji zahteva klasičan Waterfall, ali i karakteristike koje upućuju na Agile? U tom slučaju, možemo izabrati jednu od ove dve metodologije, ili ih kombinovati. S obzirom da je implementacija Dynamics ERP re\u0026scaron;enja prilično specifična, ne možđemo kombinovati te dve metodologije bez jasnih pravila. Na ovom predavanju ćemo obraditi način kako upotrebiti najbolje od oba tipa upravljanja projektima.\u003c/p\u003e\r\n\r\n\u003cdiv class=\"col-md-6\" style=\"border-radius: 0px !important; width: 600px; color: rgb(102, 102, 102); text-transform: none; text-indent: 0px; letter-spacing: normal; padding-right: 15px; padding-left: 15px; font-family: \u0026quot;Open Sans\u0026quot;, sans-serif; font-size: 14px; font-style: normal; font-weight: normal; word-spacing: 0px; float: left; white-space: normal; position: relative; min-height: 1px; box-sizing: border-box; orphans: 2; widows: 2; box-shadow: none !important; text-shadow: none !important; background-color: rgb(255, 255, 255); font-variant-ligatures: normal; font-variant-caps: normal; -webkit-text-stroke-width: 0px;\"\u003e\u0026nbsp;\u003c/div\u003e\r\n"},{"Id":2229,"Track":"SRV","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":300,"RoomId":2,"Title":"Shielded Virtual Machines - kako zaštititi podatke u Hyper-V virtualnim mašinama ","Description":"\u003cp\u003eServer 2016 nam donosi niz novih stvari na polju virtualizacije. Poseban trud je uložen na povećanju bezbednosti podataka unutar virtualnih ma\u0026scaron;ina kako bi bili sigurni da administratori Hyper-v platforme ne mogu čitati i sadržaje na\u0026scaron;ih virtualnih diskova. Na predavanju ćemo napraviti pregled novih mogućnosti za\u0026scaron;tite virtualnih ma\u0026scaron;ina i demo primer primene funkcionalnosti Shielded VM.\u003c/p\u003e\r\n"},{"Id":2281,"Track":"DEV","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"When TDD Met Abstract Data Types: Bringing Perfection to the Table","Description":"\u003cp\u003eIt\u0026#39;s been more than ten years since Test-Driven Development was brought into life and still it is covered with mystery. Many teams are struggling to apply it. Companies report test-first projects falling into same traps as test-last ones used to fall into. Is there a way for TDD to deliver its proclaimed goals and produce code of better quality?\u003c/p\u003e\r\n\r\n\u003cp\u003eIn this demonstration you will see an important technique which can be applied to TDD more than to any other testing approach. It is the use of Abstract Data Types - ADTs for short. As it turns, tests written before concrete implementation are a perfect match to ADTs which, by their very definition, are also defining the type before it is implemented.\u003c/p\u003e\r\n\r\n\u003cp\u003eThrough an elaborate example you will learn how to produce rock-solid object-oriented design while following usual practices of TDD, this time enriched with proper use of ADTs.\u003c/p\u003e\r\n"},{"Id":2254,"Track":"SES","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"How deep the rabbit hole goes?","Description":"\u003cp\u003eKrucijalno pitanje koje je Morpheus postavio Neu, nakon \u0026scaron;to je ovaj izbarao pravu (ili pogre\u0026scaron;nu) pilulu. Od ovog pitanja ide cijela priča, koja nema kraja i u kojoj ćemo se potrudiit da vidimo dubine Skype For Business priče. I nećemo puno pričati o ovozemaljskim implementacijama (iako cemo se dotaktnuti Cloud Connector Editon samo kao PSTN bridge), već ćemo da vidimo gdje je oti\u0026scaron;la cloud / online priča po pitanju Skype For Business. Da li je Skype4B već danas postao nezaobilazni servis, koji će omogućiti timovima puno bržu i lak\u0026scaron;u saradnju na bilo kojem polju? Gdje se danas nalazi Skype4B u poređenju s ostalim audio video servisima? Kakva mu je budućnost, \u0026scaron;ta možemo očekivati? I mozda ono sto Vas najvise interesuje, sta se nalazi iza Skype4B cloud? Fokusiraćemo se na komunikacije, dostupnost i analitiku. Možda otkrijemo koliko je duboka rupa u koju je upala Alisa na kraju predavanja. Nagrade? - Budu! Kakve? - Dobre!\u003c/p\u003e\r\n"},{"Id":2284,"Track":"DBI","DayId":1,"TimeLine":1,"Lang":"English","Level":200,"RoomId":5,"Title":"Practical usage of partitioning","Description":"\u003cp\u003eYou may already heard about partitioning as a way to split large tables into smaller pieces. However, is it the only way of partitioning usage? When to start using it and what are pros and cons? What are different ways to partition table? How to choose right columns, functions and schemas? I will answer all these questions by using the real world examples.\u003c/p\u003e\r\n"},{"Id":2230,"Track":"DEV","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":400,"RoomId":6,"Title":"Razvoj klijentskih aplikacija za sve platforme: OpenMVVM","Description":"\u003cp\u003eNajavljen kao Proof of Concept na prethodnoj Tarabici, OpenMVVM je ugledao svetlost dana!\u003c/p\u003e\r\n\r\n\u003cp\u003eDodjite da pogledate kako izgleda novi Framework za razvoj klijentskih aplikacija za sve platforme, kori\u0026scaron;ćenjem HTML5/CSS tehnologija za izradu korisničkog interfejsa, i C# jezika za aplikativnu logiku.\u003c/p\u003e\r\n\r\n\u003cp\u003eTakođe, predstavićemo novu verziju zvanične aplikacije Tarabica konferencije, napravljenu upravo na OpenMVVM framework-u.\u003c/p\u003e\r\n\r\n\u003cp\u003eVidimo se!\u003c/p\u003e\r\n"},{"Id":2269,"Track":"ALM","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":7,"Title":" Real world DevOps with the Microsoft ALM Rangers","Description":"\u003cp\u003eDo you know the Microsoft ALM Rangers? Did you know that this group of people builds and runs multiple tools and publishes all kinds of guidance using Visual Studio Team Services? In this session you\u0026#39;ll get an inside look into what the ALM Rangers do and how their real world use of Visual Studio Team Services thought them a lot of best-practices and other tips and tricks.\u003c/p\u003e\r\n"},{"Id":2256,"Track":"DBI","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":8,"Title":"DBA in the cloud ","Description":"\u003cp\u003eUvodjenjem cloud servisa uloga DBA se znatno promjenila u odnosu na tradicionalnu rolu sa bazama podataka u lokalnoj infrastrukturi. Pogledajte sta Azure predstavlja za administratore baza podataka, koji su izazovi I koje prednosti u koristenju cloud servisa.\u003c/p\u003e\r\n"},{"Id":2292,"Track":"DYN","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"How to - Dynamics 365 Field Service and Project Service management ","Description":"\u003cp\u003eInstalacija, konfiguracija i podesavanje Dynamics 365 Field Service\u0026nbsp;i Project Service Automation.\u003c/p\u003e\r\n"},{"Id":2339,"Track":"DVC","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":200,"RoomId":2,"Title":"Usability Testing na primeru Universal Windows App","Description":"\u003cp\u003eKoliko lako možete da koristite aplikaciju koju ste napravili? Koliko lako se korisnik koji prvi put dolazi u dodir sa va\u0026scaron;om aplikacijom može da koristi aplikaciju? Da li su vam sve informacije, poruke upozorenja, Error-i konzistentni? Koliko često obraćamo pažnju na ova pitanja tokom razvoja aplikacije ili nam je samo bitno da se \u0026scaron;to pre ispune samo klijentski zahtevi? Lako i intuitivno kori\u0026scaron;ćenje aplikacije je jako bitno, jer bez toga na\u0026scaron;a aplikacije će vrlo brzo biti obrisana sa uređaja i dobiće negativne komentare na store-u. Usability testing je jako bitan pre objavljivanja aplikacije na store. Na ovom predavanju ćete imati prilike da se upoznate sa tehnikama, procesima Usability Testing-a i skillovima koje tester treba da ima za kvalitetno Usability testiranje.\u003c/p\u003e\r\n"},{"Id":2249,"Track":"CLD","DayId":1,"TimeLine":2,"Lang":"English","Level":200,"RoomId":3,"Title":"Azure Resource Manager or how to create your cloud infrastructure by the power of thought","Description":"\u003cp\u003eWhen you start working with some new technology it\u0026#39;s always easier to start with some GUI. After you mastered it, you can switch to more \u0026quot;scripting way\u0026quot;. This is obviously for the better, because now you can automate all routine tasks and enjoy your life. But, what if I will told you, that there is even more efficient way to automate everything?\u003c/p\u003e\r\n\r\n\u003cp\u003eDuring this topic we will go through several tools for managing your infrastructure in Microsoft Azure cloud. First, we will start with Azure Portal as a tool you can easily start using at the beginning of your journey to cloud. Then we will switch to PowerShell and Cross Platform console tools to manage your Azure subscription resources. After that we will switch to Azure Resource Manager. This is the most powerful way to manage your Azure resources. The main concept of Azure Resource Manager is to give you the ability to create a template which will describe all needed resources with all required dependencies, configuration parameters, etc. The declarative way has a lot of benefits: it\u0026#39;s much easier for humans to read and understand it, the resources can be created in parallel and resource provision will consume less time, etc.\u003c/p\u003e\r\n"},{"Id":2266,"Track":"SES","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"Microsoft EOP i Office 365 Advanced Threat Protection ","Description":"\u003cp\u003eExchange Online Protection je email protection servis koji se može iskoristiti za za\u0026scaron;titu on-premise Exchange infrastrukture. Dolazi i kao deo Exchange Online paketa i podrazumevano je aktivan, \u0026scaron;titeći mailbox od samog početka.\u003c/p\u003e\r\n\r\n\u003cp\u003eOffice 365 Advanced Threat Protection je paket koji poseduje naprednije mogućnosti, a samim tim i bolji nivo za\u0026scaron;tite u odnosu na EOP. U kombinaciji sa postojećim EOP funkcijama, Office365 ATP omogućava za\u0026scaron;titu protiv novih pretnji u realnom vremenu.\u003c/p\u003e\r\n\r\n\u003cp\u003eTokom predavanja ćemo se podsetiti na koje nas sve načine EOP \u0026scaron;titi, a zatim ćemo videti koje su to funkcionalnosti koje Office365 ATP donosi i kojima pobolj\u0026scaron;ava sigurnost čitave e-mail infrastrukture, bilo on-premises ili u cloud-u.\u003c/p\u003e\r\n"},{"Id":2323,"Track":"DBI","DayId":1,"TimeLine":2,"Lang":"English","Level":300,"RoomId":5,"Title":"FILETABLEs: What They Are and How to Use Them","Description":"\u003cp\u003eHave you ever had the need to access documents in your database as if they were files in the file system? SQL Server 2012 introduces a brand new method for managing large data objects (BLOBs) in a database. FILETABLEs provide access to data using Transact-SQL - just like any other table inside the database, while at the same time also provide access to the data using the operating system File I/O API - i.e. just like any other folder in the file system. In this session you will learn how to upgrade your document management solutions by migrating your large data to FILETABLEs. The session covers two most typical migration scenarios: migrating from a distributed data store, and from a homogeneous data store.\u003c/p\u003e\r\n"},{"Id":2337,"Track":"SRV","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":400,"RoomId":6,"Title":"Privileged Access Management sa Microsoft Identity Managerom - hard core sistem administracija","Description":"\u003cp\u003eUpravljanje privilegovanim nalozima sve je bitnije, jer najveći deo napada cilja upravo na ugrožavanje identiteta korisnika koji imaju privilegovane naloge. Windows Server nema adekvatnih built-in alata koji bi pomogli da se ovi nalozi, za\u0026scaron;tite, prate te da se logiraju aktivnosti koje se pod njima izvr\u0026scaron;e. Microsoft Identity Manager 2016\u0026nbsp;i Windows Server 2016 zajedno, donose novi koncept sistem administracije - uspostavom bastion foresta za administrativne naloge uz identity management sa MIM-om, danas možemo na potpuno novi način posmatrati i realizovati sigurnost privilegovanih naloga. Ako ste system admin ili inženjer\u0026nbsp;sa iskustvom i zanima vas sigurnost i identity management\u0026nbsp; - ovo je tema za vas!\u003c/p\u003e\r\n"},{"Id":2306,"Track":"DEV","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":300,"RoomId":7,"Title":"Visual Studio 2017","Description":"\u003cp\u003eVisual Studio je s nama već 20 godina i upravo nam stigao brži, bolji i jači nego ikada i učvrstio svoju poziciju ultimativnog development alata! Za\u0026scaron;to napraviti upgrade na Visual Studio 2017? Demonistrirati ćemo pobolj\u0026scaron;anja navigacije, intellisense-a, code-lensa, debugginga, live code analysis, live unit testing i jo\u0026scaron; mnogo toga. Pokazati ćemo kako sa novim VS2017 jednostavno možete kreirati moderne aplikacije sa microservisima i jednostavno ih deployati na Docker containere. Demonstrirati ćemo i neke skrivene opcije ovoga alata koje nam ola\u0026scaron;avaju developerski život.\u003c/p\u003e\r\n"},{"Id":2332,"Track":"DBI","DayId":1,"TimeLine":2,"Lang":"English","Level":300,"RoomId":8,"Title":"Azure SQL Data Warehouse: Deep Dive","Description":"\u003cpre\u003e\r\nThis is advanced topic about Azure SQL Data Warehouse. Here I will cover main concepts like Data Movement, Workload concurrency, Resource Management, Statistics.\u003c/pre\u003e\r\n"},{"Id":2263,"Track":"MSC","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"Dizajn šabloni u testiranju- tricks\u0026tips","Description":"\u003cp\u003eRučno testirаnje može biti dugotrаjаn proces (ponekad i sklon gre\u0026scaron;kаmа), te аutomаtizаcija testova dolаzi kаo prirodno re\u0026scaron;enje. Kreiranje i egzekucija аutomаtskih testova nudi timu mogućnost dа se fokusirа nа produktivnije poslove, umesto dа ponavlja iste korаke iznovа i iznovа.\u003c/p\u003e\r\n\r\n\u003cp\u003eIT svet je svet koji se oslanja na obrasce te tako oni postoje i u testingu.\u003c/p\u003e\r\n\r\n\u003cp\u003eTester trebа dа izgrаdi test dizаjn spram test \u0026scaron;ablona koji se mogu iznova upotrebljavati, i koji su zаjednički velikom broju problemа аplikаcijа zа testirаnje. Uključivаnje ovih \u0026scaron;ablona kаo stаndаrdni deo testа-dizаjna smаnjuje vreme koje je provedeno u test dizаjna, elimini\u0026scaron;ući potrebu dа se počne sа prаznom test-dizajn dokumentаcijom.\u003c/p\u003e\r\n\r\n\u003cp\u003eU okviru svog predavanja osvrnuću se na dizajn \u0026scaron;ablone prilikom kreiranja test scenarija u okviru automatskog testiranja.\u003c/p\u003e\r\n\r\n\u003cp\u003eS obzirom na to da ih ima dosta, dala bih osvrt na nekoliko najče\u0026scaron;ćih kao \u0026scaron;to su: Page Object, Facade i Singleton.\u003c/p\u003e\r\n\r\n\u003cp\u003eNe bih radila live demo, ali bih prikazala delove koda i primere kako se \u0026scaron;abloni mogu upotrebiti u automatskom testiranju kako bi ono bilo \u0026scaron;to efikasnije. Objasnila bih principe po kojima tester treba da se vodi prilikom odabira \u0026scaron;ablona i kako da upotrebom istih održava svoje testove. Dala bih osvrt kako na teorijski tako na praktični deo obja\u0026scaron;njenja \u0026scaron;ablona, njihovu upotrebu, pozitivne i negativne strane, objasnila strategiju za njihov dizajn i implementaciju istog, i za kraj bih ostavila takozvane \u0026quot;best practice\u0026quot; savete.\u003c/p\u003e\r\n\r\n\u003cp\u003eOvo predavanje bih rekla da je za one koji se bave testiranjem softvera, da su upoznati sa položajem i ulogom QA-ja u jednoj kompaniji, da imaju predatavu \u0026scaron;ta su \u0026scaron;abloni u testiranju... Ipak, prilagodila bih svoje predavanje dovoljno da ga mogu slu\u0026scaron;ati i oni koji nisu dovoljno duboko upoznati sa ovom materijom jer, kako volim da kažem: najbolje se uči i obja\u0026scaron;njava kroz primere a ne suvu teoriju.\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n"},{"Id":2351,"Track":"DBI","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":200,"RoomId":2,"Title":"Database Lifecycle Management","Description":"\u003cp\u003eVerzionisanje koda je sastavni deo dobre prakse u radu na razvoju aplikativnih re\u0026scaron;enja. Značaj ovog pitanja nas je odveo dalje i sve značajnije firme danas govore o Application Lifecycle Management-u kao kontinuiranom upravljanju razvoja.\u003c/p\u003e\r\n\r\n\u003cp\u003eAli \u0026scaron;ta je sa bazama podataka? Da li ste se zapitali kako ćete se vratiti na prethodnu verziju baze podataka? Koji su sve objekti u bazi doživeli promenu i koje je bilo njihovo prethodno stanje? \u0026Scaron;ta je sa podacima? Da li je potrebno izvr\u0026scaron;iti rollback sadržaja nekih tabela?\u003c/p\u003e\r\n\r\n\u003cp\u003eI ako imate odgovor na ova pitanja, da li je to dovoljno? Da li je moguće obezbediti kontinuitet u razvoju baza podataka?\u003c/p\u003e\r\n\r\n\u003cp\u003eOdgovore na ova pitanja i neke smernice kako doći do kontinualnog Database Lifecycle Management-a ćete čuti ukoliko dođete na ovo predavanje.\u003c/p\u003e\r\n"},{"Id":2293,"Track":"WEB","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"React i ASP.NET Core - kombinacija iz snova","Description":"\u003cp\u003eASP.NET već dolazi s Razorom - slojem zaduženim za prezentaciju. Za\u0026scaron;to bi onda zamijenili Razor sa SPA frameworkom poput ReactJSa, Angulara ili Aurelie? \u0026Scaron;tovi\u0026scaron;e, za\u0026scaron;to bi React koristili na ASP.NETu umjesto na Node.js-u? Ako vas zanima budućnost razvoja modernih web aplikacija, ovo predavanje je za vas. Vidjet ćete kako doći do neviđene produktivnosti koristeći cijeli node ekosustav s centrom u ASP.NETu i vama poznatom frameworku.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003c!--EndFragment--\u003e\u003c/p\u003e\r\n"},{"Id":2301,"Track":"SES","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":200,"RoomId":4,"Title":"Kako učvrstiti vaš Office 365 - Hardening Office 365","Description":"\u003cp\u003eOffice 365 je skup servisa koje kroz jedinstveni paket tvrtka dobija na kori\u0026scaron;tenje. Koliko god bili sigurni, te servise se moze učvrstiti (hardening) da budu jos sigurniji. Najbitniji servisi koji cuvaju vase podatke su SharePoint Online, OneDrive for Business, Exchange. Na ovom predavanju bi se pokazalo kako uz ugrađene metode za\u0026scaron;tite učvrtiti va\u0026scaron; Office 365 \u0026nbsp;i pojačati sigurnost u Office 365. Na predavanju cemo prikazati, na tri ključna servisa (SPO, EO, Onedrive for Business) sigurnosne mjere koje se zaborave ili se o njima ne misli.\u003c/p\u003e\r\n"},{"Id":2276,"Track":"CLD","DayId":1,"TimeLine":3,"Lang":"English","Level":200,"RoomId":5,"Title":"Our First Service Fabric On-Premise Release","Description":"\u003cp\u003eAfter a long and bumpy journey we started with the RC1 version of Microsoft Service Fabric, the first version of our microservice cluster is finally released. In this new platform from configuration to diagnostics, architecture to testing; we experimented with many new concepts. This presentation will give insights and explain real-world problems developers and dev-ops team face while developing applications for Service Fabric.\u003c/p\u003e\r\n"},{"Id":2331,"Track":"DEV","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":6,"Title":"Implementing high performance image gallery app using Xamarin Forms","Description":"\u003cp\u003eXamarin Forms je framework u koji omogućava kreiranje Android, iOS i Windows aplikacija kompletno u jednom C# codebase-u. Nakon skoro 3 godine postojanja i godine otkad je Microsoft kupio Xamarin, ovaj framework se konačno može smatrati dovoljno zrelim.\u003c/p\u003e\r\n\r\n\u003cp\u003eNa ovoj sesiju ću prezentovati DailyCat - Xamarin Forms aplikaciju koja ima:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003eTinder-style SwipeCardView\u003c/li\u003e\r\n\t\u003cli\u003eInstagram-style ListView i GridView\u003c/li\u003e\r\n\t\u003cli\u003eNotifikacije kori\u0026scaron;ćenjem Google FCM (Firebase Cloud Messaging) i Azure Functions\u003c/li\u003e\r\n\t\u003cli\u003eNative Look \u0026amp; Feel (Android and iOS)\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003cp\u003ePosebna pažnja biće posvećena performansama Xamarin Forms aplikacija i savetima kako izvući maksimum iz ovog framework-a.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cimg alt=\"\" src=\"http://i66.tinypic.com/2nh2lp4.png\" style=\"height:356px; width:200px\" /\u003e\u0026nbsp;\u003cimg alt=\"\" src=\"http://i68.tinypic.com/2h5psw9.png\" style=\"height:356px; width:200px\" /\u003e\u003cimg alt=\"\" src=\"http://i66.tinypic.com/m79ea.png\" style=\"height:356px; width:200px\" /\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003ca href=\"https://play.google.com/store/apps/details?id=dailycat.droid\" target=\"_blank\"\u003e\u003cimg alt=\"\" src=\"http://i66.tinypic.com/am2n9f.jpg\" style=\"float:left; height:58px; width:150px\" /\u003e\u003c/a\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n"},{"Id":2310,"Track":"SRV","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":7,"Title":"Kako sa novim tehnologijama graditi datacentar buducnosti","Description":"\u003cp\u003eSesija ce prikazati na praktičnim primerima kako na Microsoftovim tehnologijama graditi datacenter platformu buducnosti t.i. software defined datacenter kde sve infrastrukturne servise pokrecemo direktno u sastavu serverskog operativnog sistema. Kako pripremiti hardware i kako konfigurirati datacenter od network i storage nivoa do virtualizacijske platforme Hyper-V na kojoj pokrecemo aplikacije.\u003c/p\u003e\r\n"},{"Id":2291,"Track":"DBI","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":8,"Title":"Power User u Power BI okruženju","Description":"\u003cp\u003eNe tako davno, ne isključujući dana\u0026scaron;njost, veoma često prilikom pravljenja re\u0026scaron;enja za poslovno obave\u0026scaron;tavanje (Business Intelligence) preveliki broj gre\u0026scaron;aka\u0026nbsp;bio je\u0026nbsp;posledica nerazumevanja između developera i krajnjih korisnika. Često puta nerazumevanje \u0026scaron;ta je potrebno, a\u0026nbsp;\u0026scaron;ta je moguće napraviti, pod uslovom da su uop\u0026scaron;te uspeli da se razumeju developerska i poslovna strana, dovodilo je do frustracije obe strane. Ponekad sa katastrofalnim posledicama po re\u0026scaron;enje. Pored toga, eksplozija potreba za informacijama, pre svega upotrebom mobilnih uređaja i Cloud mogućnosti doveli su\u0026nbsp;do prevelikog pritiska na developersku stranu, sa prevelikim ka\u0026scaron;njenjem u izradama re\u0026scaron;enja. Power User je naziv za sve one savremene krajnje korisnike koji imaju potrebu da analiziraju podatke. Uglavnom su to menadžeri srednjeg sloja, ali i svaki svaka druga osoba.Glavna karakteristika te uloge je da ima potrebu za informisanjem kao krajnji korisnik, a može uraditi i deo developerskog posla\u0026nbsp;u skladu sa sopstvenim znanjem, bilo kakvim počev od znanja rada sa\u0026nbsp;bazama podataka\u0026nbsp;do najelementarnijih znaja rada samo sa podacima. Tokom sesije biće pokazano kako Power User može pomoći i sebi i developerima koristeći svoje znanje i MS Power Bi alate.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n"},{"Id":2335,"Track":"DVC","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":1,"Title":"Windows 10 na svaku napravu!","Description":"\u003cp\u003eKada ste instalirali Windows 10, sigurno ste primetili da je instalacija brža nego ranije. No ako ste Windows instalirali vi\u0026scaron;e puta, verovatno ste se zapitali, kako bi mogli da utječete na instalaciju i podesite dodatne opcije, po kojima vas instalacija ne pita. Na predavanju čemo upoznati oruđa i tehnologije koje so koriste kod name\u0026scaron;tanja i prilagođavanja Windows sistema. Pogledačemo kako da kreiramo answer datoteku, \u0026scaron;ta se krije u Install.wim fajlu, kako ga možemo promeniti i dodati svoj Windows image, npr. sa uključenim Office 2016. Videčemo gde se koristi Windows PE i \u0026scaron;ta sve krije Windows Assessment and Deployment Kit. A ako več imate Windows 10 napravu, sigurno če vas zanimati kako bi je mogli u jednom koraku konfigurisati, \u0026scaron;to vam omogučava provisioning paket.\u003c/p\u003e\r\n"},{"Id":2329,"Track":"DEV","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":2,"Title":".NET Core from the tranches","Description":"\u003cp\u003eKako izgleda borba sa novim Frameworkom iz prvih redova.\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003eRazvoj novog sistema uvek predstavlja veliki izazov, pogotovo ako se odabere Framework koji je jo\u0026scaron; u razvoju.\u003c/p\u003e\r\n\r\n\u003cp\u003e.NET Standard, .NET Core, ASP.NET Core, EF Core, sa reprezentativnim primerima će biti srž ovog predavanja, sa posebnim osvrton na sve probleme na koje je tim nai\u0026scaron;ao.\u003c/p\u003e\r\n\r\n\u003cp\u003eSvi primeri će raditi i na MacOS-u, a možda i na nekom od IoT uređaja.\u003c/p\u003e\r\n"},{"Id":2338,"Track":"DBI","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"Temproal tables iz DWH ugla","Description":"\u003cp\u003eJedna od novina MS SQL 2016 je system-versioned temporal tables (ANSI SQL 2011) koja nam omugućava praćenje svih izmena nad tabelom. S druge strane, jedan od DWH izazova je jednostavno i brzo detektovati izmene koje su se desile nad tabelama od interesa za DWH re\u0026scaron;enja. Tradicionalni pristup je izrada Change Data Capture sloja ETL koristeći replikaciju ili, ređe, direktno nad OLTP bazom.\u003c/p\u003e\r\n\r\n\u003cp\u003eNa ovom predavanju biće predstavljena nova funkcionalnost - temporal table iz DWH ugla. Kako pomoću temporal table napraviti CDC? Da li nam je klasičan CDC uop\u0026scaron;te potreban? Da li se temproal tables mogu koristiti tako da kreirate SCD Type 1 a dobijete SCD Type 2 atribute?\u003c/p\u003e\r\n"},{"Id":2328,"Track":"SES","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"O365 u Enterprise okruženju - Worldwide implementacija ","Description":"\u003cp\u003eTvrtka sa 45000 zaposlenih i 18000 korisnika IT usluga \u0026scaron;irom svijeta odlučila je implementirati O365. Prilikom odluke vodilo se računa o tome a rje\u0026scaron;enje treba povezivati različite timove, sa raznih strana svijeta koji trebaju kolaborirati zajedno, pratiti rezultate, izvje\u0026scaron;tavati, izmjenjivati elektroničku po\u0026scaron;tu i sl. Kako se radi o hibridnom okruženju SharePoint online i Exchange online su se pokazali kao odlično rje\u0026scaron;enje, ne samo za kolaboraciju nego i za standardizaciju. Iskoristio se i self service password reset iz Azure Active Directorya kako bi se smanjio impact na 1st level support. Tijekom predavanja prikazati ćemo kako se uporabom oblaka i kombiniranja tehnologija može postići bolja produktivnost i ostvariti značajnije u\u0026scaron;tede u poslovanju kroz cost/benefit analizu\u003c/p\u003e\r\n"},{"Id":2280,"Track":"MSC","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":200,"RoomId":5,"Title":"Sve što ste hteli da znate o svom prvom robotu, a niste smeli da pitate","Description":"\u003cp\u003eKako da napravite svoj prvi robot? \u0026Scaron;ta da kupite (sa naglaskom možete li i u Srbiji)? Kako da ga sklopite i možda kako da počnete da ga usavr\u0026scaron;avate? Kako da ih programirate, u kom programskom jeziku i s kojim alatima? Koje su najrasprostranjeniji setovi za pravljenje robota? Mnogo pitanja na koja ćete naći odgovore na ovom predavanju. Predavanje će održavati roboti: STS-Pi, Zumo, Lego Mindstorms EV3, Cheetah Pi3, s nekom pomoću od ljudskih bića Rastko Đorđević (iz tima PoliBoti prvacima na First Lego League u regionu) i Catalin Gheorghiu (Microsoft MVP).\u003c/p\u003e\r\n"},{"Id":2289,"Track":"WEB","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":200,"RoomId":6,"Title":"Testing JavaScript - tooling and integration","Description":"\u003cp\u003eJavaScript code is code - and as more and more code is done with it, we need to test it to ensure that the code is functional. This presentation will provide an overview of the current state of the art of testing JavaScript, focusing on the available toolchain.\u003c/p\u003e\r\n\r\n\u003cp\u003eTools that will be used during the presentation include Jasmine, Karma, Istanbul, Stryker.\u003c/p\u003e\r\n"},{"Id":2349,"Track":"SRV","DayId":1,"TimeLine":4,"Lang":"English","Level":300,"RoomId":7,"Title":"My own Security Bulletin MS16-081 - how was it all about","Description":"\u003cp\u003e\u003cspan style=\"color:rgb(31, 73, 125); font-family:calibri,sans-serif; font-size:11pt\"\u003eLast year I discovered and reported a DoS attack issue in Active Directory which affected all existing versions of Windows including the brand new Windows 2016. It has already been my second discovery which has been acknowledged and patched by Microsoft. I also reported some that were not acknowledged :-) I will share my experience with reporting and documenting the bugs with the Microsoft Security Response Center, how the communication and patching evolved in each case. I will also demonstrate all the details about the AD DoS bug which is based on some interesting facts and shows rather generic design lesson. It would also be impossible if there was not a default insecurity in configuration of Active Directory which affects roughly 90% of all AD environments over the world.\u003c/span\u003e\u003c/p\u003e\r\n"},{"Id":2345,"Track":"MSC","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":200,"RoomId":8,"Title":"Panel diskusija","Description":"\u003cp\u003eTBD\u003c/p\u003e\r\n"},{"Id":2237,"Track":"SRV","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":1,"Title":"Nano Server Management for GUI Lovers","Description":"\u003cp\u003eNano Server is a new GUI-less Windows Server installation option. However, that doesn\u0026#39;t mean you need to be a PowerShell expert (although being one greatly helps) to manage a Nano Server. Microsoft has built and enabled a lot of GUI tools to make remote management of Nano Server easier. We cover everything you need to know in order to create a Nano Server image using Image Builder, and how Recovery Console could help to re-establish remote connectivity. Join us to learn how to deploy and use the web-based Server Management Tools (SMT) for remote management and troubleshooting. The best part of the story is that demonstrated management tools are applicable to any Windows Server installation.\u003c/p\u003e\r\n"},{"Id":2268,"Track":"MSC","DayId":1,"TimeLine":5,"Lang":"English","Level":300,"RoomId":2,"Title":"The Secret of Engaging Presentations","Description":"\u003cp\u003eHave you recently been at a boring presentation? And what about one that got your attention and kept you on the edge of your chair? Why did that happen? Can you too create such an engaging presentation? In this session we will take a look behind the scenes. We will go deep into what makes a presentation memorable and I will show you what is the \u0026quot;formula\u0026quot; that will not only explain you why some presentations are talked about, but also, how you can apply this \u0026quot;algorithm\u0026quot; and make sure that your talks will be truly effective. Yes, we use this \u0026quot;trick\u0026quot; in the presentations we create for our customers and yes, one of them just recently closed a multimillion dollar deal because of it! Should be fun, right?\u003c/p\u003e\r\n"},{"Id":2235,"Track":"SRV","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"Disaster Recovery for Hyper-V","Description":"\u003cp\u003eJeste li ikad zapitali može li va\u0026scaron;a tvrtka nastaviti rad ukoliko se dogodi katastrofa i va\u0026scaron;i podaci nestanu? Naravno da jeste, ali jeste li poduzeli sve mjere opreza da iako se takvo ne\u0026scaron;to dogodi, možete nesmetano ili barem u najkraćem mogućem roku nastaviti s poslovanjem? Budimo realni, u nekom trenutku svima nama se dogodilo ili će se dogoditi da nam podaci, serveri, mreža ili bilo koji kritični servis budu ugroženi ili da ostanemo bez njega. Windows Server 2016 nudi nam pregr\u0026scaron;t alata i mogućnosti kako bi mogli spriječiti da nam se gore navedeno ne dogodi, te da \u0026scaron;to brže vratimo sustav na pravi put. Na koji način to možemo spriječiti? Kroz Windows Server Backup, visoku dostupnost, Hyper-V Repliku ili ne\u0026scaron;to drugo! Ovo predavanje će vas provesti kroz najvažnije postupke postavljanja Hyper-V infrastrukture kako bi spriječili katastrofu.\u003c/p\u003e\r\n"},{"Id":2350,"Track":"SES","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"Kako migrirati Exchange 2007 na Office 365?","Description":"\u003cp\u003eU susret 11. Aprilu 2017, kada nastupa \u0026quot;end of life\u0026quot; Exchange servera 2007, kao i mnogim benefitima koje pruža platforma office 365 i Exchange online - kao deo te platforme, razmotrićemo koje su mogućnosti migracije u Microsoft-ov klaud, sa posebnim osvrtom na postepenu ( staged ) migraciju i \u0026quot;real life\u0026quot; scenario.\u003c/p\u003e\r\n"},{"Id":2348,"Track":"WEB","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":5,"Title":"ASP.NET Core","Description":"\u003cp\u003e-\u003c/p\u003e\r\n"},{"Id":2341,"Track":"DYN","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":200,"RoomId":6,"Title":"Automatizacija procesa u Dynamics 365 for Financials (NAV) korišćenjem Microsoft Flow-a ","Description":"\u003cp\u003ePredstavljanje mogućnosti integracije ERP sistema sa ostalim productivity alatima, socijalnim mrežama i sl..\u003c/p\u003e\r\n"},{"Id":2261,"Track":"DBI","DayId":1,"TimeLine":5,"Lang":"English","Level":200,"RoomId":7,"Title":"Creating Custom Visuals in Power BI with TypeScript and D3.js","Description":"\u003cpre\u003e\r\nThis presentation is about how to create custom visuals (components) for your PowerBI reports. Power BI reporting features could be extended with custom components, that developers can implement and BI specialist can include in their dashboards. Many visuals are also availabe in the Power BI Visuals Gallery.\r\n\r\nPower BI is flexible with which graphical API you prefer to use, but their open source project is all D3.\r\n\r\nD3.js is a JavaScript library of objects to produce sophisticated, interactive, dynamic data visualizations using modern web-based technologies\r\n\r\nIn this talk you will learn how to:\r\n- Set up the dev environment (using PowerBI visuals CLI tool)\r\n- Build your visuals\r\n- Debug your Power BI components\r\n- Use custom visuals in your dashboards\r\n- Publish visuals to Power BI Visuals Gallery\r\n- Roadmap of Power BI Visuals API\u003c/pre\u003e\r\n"},{"Id":2347,"Track":"DBI","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":8,"Title":"SQL Server i JSON","Description":"\u003cp\u003eTBD\u003c/p\u003e\r\n"},{"Id":2343,"Track":"DYN","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"Koliko možemo da savijemo Dynamics 365, a da ne pukne?","Description":"\u003cp\u003eDynamics 365 (ex CRM) se svakom verzijom unapređuje u\u0026nbsp;pravcu\u0026nbsp;da korisnicima i konsultantima pruži mogućnost da pro\u0026scaron;ire funkcionalnosti sistema ili da ga povežu sa drugim servisima bez programiranja (upotreba koda u naj\u0026scaron;irem smislu). Codeless i/ili framework inicijative su sve popularnije, pa u tom smislu i Microsoft prati trendove. Pa, koliko možemo savijati (prilagođavati) Dynamics 365 kroz ugrađene alate, a da ne pukne (programiramo). Neke od tema koje ćemo obraditi su:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003ePower Apps i Flow\u003c/li\u003e\r\n\t\u003cli\u003eNovi Workflow\u0026nbsp;i Business Rule vizuelni editor\u003c/li\u003e\r\n\t\u003cli\u003eNove kontrole na formama za desktop i mobilne prikaze\u003c/li\u003e\r\n\u003c/ul\u003e\r\n"},{"Id":2243,"Track":"DEV","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":2,"Title":"Getting Started with Aurelia","Description":"\u003cp\u003eAurelia is a rich framework for Single Page Application development.\u003cbr /\u003e\r\nIt has a rich data binding system, dependency injection and modules, an intuitive and powerful routing and navigation system.\u003cbr /\u003e\r\nIn this session you will get a quick introduction how to get started building applications with it.\u003c/p\u003e\r\n"},{"Id":2346,"Track":"DBI","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":200,"RoomId":3,"Title":"Uvod u Azure Machine Learning","Description":"\u003cp\u003eTBD\u003c/p\u003e\r\n"},{"Id":2315,"Track":"SRV","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":400,"RoomId":4,"Title":"Troubleshooting Exchange - Listen to your Exchange Server by reading its logs","Description":"\u003cp\u003eMany organizations rely on different monitoring solutions for troubleshooting Exchange Servers. However most of the core information about how Exchange works is well written in different log files. In this session you will learn useful guidelines on how to troubleshoot different aspects of your Exchange infrastructure by listening what your Exchange Servers are saying to you in the logs. Troubleshooting areas will include client access, transport, and database availability.\u003c/p\u003e\r\n"},{"Id":2304,"Track":"CLD","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":5,"Title":"Kako pojednostaviti poslovne procese uz Azure API i Logic Apps","Description":"\u003cp style=\"text-align: justify;\"\u003eNerijetko se nađemo u situaciji da određenu funkcionalnost trebamo koristiti u vi\u0026scaron;e različitih poslovnih procesa ali je svaki put napi\u0026scaron;emo nanovo. Istovremeno, neki poslovni procesi su toliko slični, a opet pomalo različiti da se moraju tretirati kao odvojeni i programirati zasebno. Upotrebom Azure API Apps i Azure Logic Apps, dobijamo mogućnost da enkapsuliramo segmente poslovnih procesa u funkcionalno zatvorene module koje kasnije možemo kombinovati sa već postojećim gotovim modulima za konekciju sa enterprise sistemima poput Dynamics-a ili sa dru\u0026scaron;tvenim mrežama poput Facebook-a a sa krajnjim ishodom da modeliramo pojednostavljen, jasno raspoznatljiv poslovni proces uz drastično reducirane tro\u0026scaron;kove razvoja.\u003c/p\u003e\r\n"},{"Id":2308,"Track":"SES","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":6,"Title":"Sharepoint Framework - novi izazov za SharePoint programere","Description":"\u003cp\u003eIli - za\u0026scaron;to je Microsoft jo\u0026scaron; jednom morao da promeni App/Add in model za prilagođavanje Sharepointa?\u003c/p\u003e\r\n\r\n\u003cp\u003ePrezentacija će se pozabaviti istorijskim pogledom na custom-izaciju ovog MS bestsellera, kao i dubinskom analizom trenutne arhitekture Online verzije Sharepointa, u korelaciji sa Sharepoint frameworkom.\u003c/p\u003e\r\n\r\n\u003cp\u003eAkcenat će biti bačen i na open source karakter SP Frameworka, kao i na mnogobrojne alate koji stižu u pomoć SP programerima iz Open source komune (NodeJS, NPM, Gulp, Yeoman, TypeScript, ...) \u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003eCeo koncept biće propraćen sa nekoliko Demo-a, koji će za cilj imati kreiranje, opis kao i Deploy Web partova direktno u Cloud, kreiranih, naravno, u Sharepoint frameworku.\u003c/p\u003e\r\n"},{"Id":2239,"Track":"DBI","DayId":1,"TimeLine":6,"Lang":"English","Level":300,"RoomId":7,"Title":"How much data loss is a “near zero” data loss","Description":"\u003cp\u003e\u003cspan style=\"color:rgb(51, 51, 51)\"\u003eYou have probably heard that SQL Server AlwaysON Availability Group provides a near zero data loss. But it is very important to understand what does it mean. Are you not losing any data at all in case of failover? Are you able to make such a promise? Or you are going to lose some data in some scenarios? To give an answer to yourself or to your customers, you need to understand how the Availability Group works and what happens in case you need to perform failover, when are you able to guarantee near zero data loss. In this session, I am going to describe the availability group commit and failover process and in case you are forced to perform a failover how to be understand the amount of data that have been lost. \u003c/span\u003e\u003c/p\u003e\r\n"},{"Id":2344,"Track":"MSC","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":8,"Title":"Ask MVPs!","Description":"\u003cp\u003eNa ovoj sesiji Microsoft MVPjevi će odgovarati na pitanja publike.\u003c/p\u003e\r\n\r\n\u003cp\u003eVi\u0026scaron;e detalja uskoro!\u003c/p\u003e\r\n"}],"SessionSpeakerRelations":[{"SpeakerId":13,"SessionId":2272},{"SpeakerId":15,"SessionId":2229},{"SpeakerId":27,"SessionId":2281},{"SpeakerId":44,"SessionId":2254},{"SpeakerId":1096,"SessionId":2284},{"SpeakerId":8,"SessionId":2230},{"SpeakerId":5285,"SessionId":2230},{"SpeakerId":1089,"SessionId":2269},{"SpeakerId":2200,"SessionId":2256},{"SpeakerId":5250,"SessionId":2292},{"SpeakerId":5260,"SessionId":2339},{"SpeakerId":5238,"SessionId":2249},{"SpeakerId":1052,"SessionId":2266},{"SpeakerId":5253,"SessionId":2323},{"SpeakerId":25,"SessionId":2337},{"SpeakerId":1132,"SessionId":2306},{"SpeakerId":5229,"SessionId":2332},{"SpeakerId":5242,"SessionId":2263},{"SpeakerId":5269,"SessionId":2351},{"SpeakerId":1144,"SessionId":2293},{"SpeakerId":2188,"SessionId":2301},{"SpeakerId":1109,"SessionId":2276},{"SpeakerId":2220,"SessionId":2331},{"SpeakerId":1092,"SessionId":2310},{"SpeakerId":1061,"SessionId":2291},{"SpeakerId":5254,"SessionId":2335},{"SpeakerId":1048,"SessionId":2329},{"SpeakerId":41,"SessionId":2338},{"SpeakerId":1111,"SessionId":2328},{"SpeakerId":5247,"SessionId":2280},{"SpeakerId":31,"SessionId":2280},{"SpeakerId":59,"SessionId":2289},{"SpeakerId":1088,"SessionId":2349},{"SpeakerId":15,"SessionId":2345},{"SpeakerId":46,"SessionId":2237},{"SpeakerId":5246,"SessionId":2268},{"SpeakerId":2196,"SessionId":2235},{"SpeakerId":5267,"SessionId":2350},{"SpeakerId":11,"SessionId":2348},{"SpeakerId":55,"SessionId":2341},{"SpeakerId":5241,"SessionId":2261},{"SpeakerId":2210,"SessionId":2347},{"SpeakerId":5258,"SessionId":2343},{"SpeakerId":50,"SessionId":2243},{"SpeakerId":36,"SessionId":2346},{"SpeakerId":2214,"SessionId":2315},{"SpeakerId":5233,"SessionId":2304},{"SpeakerId":1055,"SessionId":2308},{"SpeakerId":5234,"SessionId":2239},{"SpeakerId":8,"SessionId":2344}],"Slots":[{"Id":1,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":9,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":17,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":25,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":33,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":41,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":2,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":10,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":18,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":26,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":34,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":42,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":3,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":11,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":19,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":27,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":35,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":43,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":4,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":12,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":20,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":28,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":36,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":44,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":5,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":13,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":21,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":29,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":37,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":45,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":6,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":14,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":22,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":30,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":38,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":46,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":7,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":15,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":23,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":31,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":39,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":47,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30},{"Id":8,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":30,"EndHour":10,"EndMinute":30},{"Id":16,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":45,"EndHour":11,"EndMinute":45},{"Id":24,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":32,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":40,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":15,"EndHour":16,"EndMinute":15},{"Id":48,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":16,"StartMinute":30,"EndHour":17,"EndMinute":30}],"PicturesLocation":"http://tarabica.msforge.net/","Tracks":[{"Id":1,"Description":"","Title":"Application Lifecycle Management","Abbeveration":"ALM","PicturePath":"/Content/Images/tracks/ALM.png"},{"Id":13,"Description":"","Title":"Agile i upravljanje projektima","Abbeveration":"APM","PicturePath":"/Content/Images/tracks/APM.png"},{"Id":2,"Description":"","Title":"Cloud, Azure app Development ","Abbeveration":"CLD","PicturePath":"/Content/Images/tracks/CLD.png"},{"Id":3,"Description":"","Title":"Data Platform \u0026 Business Intelligence","Abbeveration":"DBI","PicturePath":"/Content/Images/tracks/DBI.png"},{"Id":4,"Description":"","Title":"Desktop Languages, Frameworks, Developer Tools ","Abbeveration":"DEV","PicturePath":"/Content/Images/tracks/DEV.png"},{"Id":9,"Description":"","Title":"Windows 10, Windows 10 Mobile \u0026 Mobile Services","Abbeveration":"DVC","PicturePath":"/Content/Images/tracks/DVC.png"},{"Id":7,"Description":"","Title":"Dynamics","Abbeveration":"DYN","PicturePath":"/Content/Images/tracks/DYN.png"},{"Id":8,"Description":"","Title":"Game Development","Abbeveration":"GAM","PicturePath":"/Content/Images/tracks/GAM.png"},{"Id":11,"Description":"","Title":"Other","Abbeveration":"MSC","PicturePath":"/Content/Images/tracks/MSC.png"},{"Id":5,"Description":"","Title":"SharePoint, Office 365 \u0026 Enterprise Social","Abbeveration":"SES","PicturePath":"/Content/Images/tracks/SES.png"},{"Id":6,"Description":"","Title":"Windows Server, Networks, Cloud Platform and Modern Datacenter ","Abbeveration":"SRV","PicturePath":"/Content/Images/tracks/SRV.png"},{"Id":12,"Description":"","Title":"Korisnicko iskustvo","Abbeveration":"UX ","PicturePath":"/Content/Images/tracks/UX .png"},{"Id":10,"Description":"","Title":"Web development","Abbeveration":"WEB","PicturePath":"/Content/Images/tracks/WEB.png"}]}